
## :white_check_mark: Apply Succeeded (user-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/62331)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.terraform_remote_state.incident_management: Read complete after 0s
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PKMDQBC]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PHQSPMP]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 1s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 1s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 1s [id=/Shared/PrivateSubnets]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 1s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 1s [id=/Shared/PublicSubnets]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/UserAPI-Prod/ecs/aws-otel-collector]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z10149322R3CAAZXPU1G7]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_sns_topic.backend_notifications: Read complete after 1s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=userapi-prod-app]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/UserAPI-Prod]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/0e8413f4-af99-48e5-ae9e-5eb26ae0c98c]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=fcbf8b89-bc35-4562-b2ac-8220282ef420:UserAPI-Prod-ECS]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_kms_alias.kms_alias: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/UserAPI-Prod/ecs/app]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=4052455996]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=UserAPI-Prod-TaskRole]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=userapi-prod-app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskRolePolicy]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=UserAPI-Prod-ECSCodeDeployRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2679175728]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_user-api.readitlater.com_NS]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/a0803719a681d372fb9d0a1961fb8a9a130b12c8]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z10149322R3CAAZXPU1G7__41c2f6790a632f4e1bbe16a424c93898.user-api.readitlater.com._CNAME]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskExecutionRolePolicy]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PL78N5E]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P5KNNXK]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P2NM9IX]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P9WYONN]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole-20210604230839183400000008]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=UserAPI-Prod]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0e9b60116b687348a]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/USRAPI20210604230838285900000004/87307e89d76d93f4]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/USRAPI20210604230838670700000007/dc97dbdacd83456f]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=UserAPI-Prod-TaskRole-2021060423083927150000000a]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 1s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 1s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-05-05 03:37:01.784 +0000 UTC]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole-2021060423083933750000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=UserAPI-Prod-ECSCodeDeployRole-20210604230839270000000009]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=b1e2e25c6043a82df36dec1ef1b60c0f829ac157]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:9a25357f-0cce-4d54-81d2-4c98464acdd0]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:21673a1e-5bb0-4ba2-a66f-1635e9269c8d]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0c830a5b2195c95b9]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=UserAPI-Prod-Alarm-HTTPResponseTime]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=UserAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z10149322R3CAAZXPU1G7_user-api.readitlater.com_A_1]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/df13cc838477d8ad]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038/3a098a2c2cf2a9af]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/UserAPI-Prod/UserAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/UserAPI-Prod/UserAPI-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=UserAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=d5e49478-6790-486d-9a1b-97443d562bc1]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=UserAPI-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=UserAPI-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=UserAPI-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=UserAPI-Prod Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod:330" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/userapi-prod-app:c0ce00969e0703ef38597b0966e3b21264b6bd30" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/userapi-prod-app:bdb8573bd8ba7a1948e908e5f122b48e6e073b5b"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserAPI-Prod" -> (known after apply)
      ~ revision                 = 330 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=UserAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=UserAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=db143bf0376ff9c36474c45fcb1661cab8566e6b]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"99a5c867-5e50-4a4f-9975-3f3d36c772c1","JobName":"user-api_infrastructure_apply_prod","PRNumber":218,"Program":"tfcmt","SHA1":"bdb8573bd8ba7a1948e908e5f122b48e6e073b5b","Target":"user-api-cdk","Vars":{}} -->